# 列表 list
# 列表是一个有序的集合，可以随时添加和删除其中的元素
# 用[]表示列表，元素之间用逗号分隔
# 列表的元素可以是不同的数据类型
# 列表的元素可以是另一个列表
# 列表的元素可以是一个函数
# 列表的元素可以是一个类
# 列表的元素可以是一个对象
# 列表的元素可以是一个字典
# 列表的元素可以是一个集合
# 列表的元素可以是一个元组
# 列表的元素可以是一个字符串
# 列表的元素可以是一个数字
# 列表的元素可以是一个布尔值
# 列表的元素可以是一个None
# 列表的元素可以是一个变量
# 列表的元素可以是一个表达式

# 列表的创建
a = []
print("a:", a, "type:", type(a))

a = [1, 2, 3]
print("a:", a, "type:", type(a))

a = [1, 2, 3, "Hello, World!", True, None]
print("a:", a, "type:", type(a))

a = [1, 2, 3, [4, 5, 6]]
print("a:", a, "type:", type(a))

a = [1, 2, 3, lambda x: x + 1]
print("a:", a, "type:", type(a))

# 列表的访问
a = [1, 2, 3]
print("a[0]:", a[0])
print("a[1]:", a[1])
print("a[2]:", a[2])

# 列表的切片
a = [1, 2, 3, 4, 5]
print("a[0:2]:", a[0:2])
print("a[1:3]:", a[1:3])
print("a[2:]:", a[2:])
print("a[:2]:", a[:2])
print("a[0:5:2]:", a[0:5:2])
print("a[::2]:", a[::2])
print("a[::-1]:", a[::-1])
print("a[-4:]:", a[-4:])

# 列表的增加
a = [1, 2, 3]
a.append(4)
print("a:", a)

# 列表的插入
a = [1, 2, 3]
a.insert(1, 4)

# ...

# 列表的删除
a = [1, 2, 3]
a.pop()
print("a:", a)

# 列表的修改
a = [1, 2, 3]
a[0] = 4

# 字典
# 字典是一个无序的集合，可以随时添加和删除其中的元素
# 用{}表示字典，元素之间用冒号分隔
# 字典的元素可以是不同的数据类型
# 字典的元素可以是另一个字典
# 字典的元素可以是一个列表
# 字典的元素可以是一个函数

# 字典的创建
a = {}
print("a:", a, "type:", type(a))

a = {"name": "Tom", "age": 18}
